testTaurus/src/test/java/com/appdirect/tools/blazemeter_junit.yaml
---
execution:
  #  - executor: selenium
  #    runner: junit
  - executor: junit
    iterations: 10   # loop over test suite for 10 times
    concurrency: 10   # number of virtual users
    ramp-up: 15s       # time of load growing
    scenario: javaTest
scenarios:
  javaTest:
    script: /Users/shrey.dhingra/Downloads/meteredUsageTaurus/testTaurus/src/test/java/com/appdirect/tools/MeterdUsageApplicationTest.java
    additional-classpath:
#      - /Users/shrey.dhingra/Desktop/jars/junit-4.12.jar
#      - /Users/shrey.dhingra/Desktop/jars/retrofit-2.4.0.jar
#      - /Users/shrey.dhingra/Desktop/jars/converter-jackson-2.4.0.jar
#      - /Users/shrey.dhingra/Desktop/jars/jackson-databind-2.9.9.jar
#      - /Users/shrey.dhingra/Desktop/jars/jackson-core-2.9.9.jar
#      - /Users/shrey.dhingra/Desktop/jars/jackson-annotations-2.9.9.jar
#      - /Users/shrey.dhingra/Desktop/jars/logging-interceptor-3.8.1.jar
      - /Users/shrey.dhingra/Desktop/jars/spring-test-5.1.10.RELEASE.jar
#      - /Users/shrey.dhingra/Desktop/jars/commons-logging-1.1.1.jar
#      - /Users/shrey.dhingra/Desktop/jars/spring-core-5.1.10.RELEASE.jar
      - /Users/shrey.dhingra/Downloads/meteredUsageTaurus/api-sdk/build/libs/api-sdk-all.jar
      - /Users/shrey.dhingra/Downloads/meteredUsageTaurus/metered-usage/build/libs/metered-usage-all.jar
      - /Users/shrey.dhingra/Downloads/meteredUsageTaurus/testTaurus/build/libs/testTaurus-all.jar
#      - /Users/shrey.dhingra/Downloads/meteredUsageTaurus/testTaurus/build/libs/testTaurus.jar

#modules:
  #  selenium:
  #    selenium-tools:
#  junit:
#    compile-target-java: 1.8
#        jar-name: /Users/shrey.dhingra/Downloads/taurusLoadJunit/build/libs/taurusLoadJunit-all-0.0.1-SNAPSHOT.jar